# 6806021610182 ณัฐวัตร จิตอารี
# 1. ให้นักศึกษาเขียนโปรแกรมทำงานเหมือนตู้ ATM ที่สามารถจ่ายเงินเป็นธนบัตรได้ 3 ชนิด คือ 100, 500 และ 1000 เมื่อได้รับข้อมูลความต้องการถอนเงินที่ลูกค้ากดมา ให้คำนวณหาจำนวนธนบัตรแต่ละชนิดที่เครื่องจะต้องจ่ายออกมา โดยเริ่มจากชนิดที่มีค่ามากที่สุดที่เป็นไปได้เสมอ

# สร้างตัวแปร number รับค่า input แบบชนิดตัวแปร Float
number = float(input("Enter number money withdraw : "))

# สร้างตัวแปรกำหนดค่า B1000 กำหนดค่าให้ เอา number มาหาร 1000 เอาจำนวนเต็ม
B1000 = number // 1000

# สร้างตัวแปร number มาเอา number หารเอาเศษ 1000
number = number % 1000

# สร้างตัวแปร B500 กำหนดค่าให้เอา number มาหารเอาเศษ 500
B500 = number // 500

# เอาตัวแปร number มาหารเอาเศษ 500
number = number % 500

# สร้างตัวแปร B100 มากำหนดให้ number หาร 100 เอาจำนวนเต็ม
B100 = number // 100

# print แสดงผลลัพธ์ ของแต่ละธนบัตร 3 ชนิดว่าจะได้จำนวนแบงค์ 1000,500,100 เท่าไหร่
print("Cash B1000 : ",B1000)
print("Cash B500 : ",B500)
print("Cash B100 : ",B100)