# 6806021610182 ณัฐวัตร จิตอารี
# 2. ให้นักศึกษาเขียนโปรแกรมแสดงข้อมูลตัวเลข 4 หลักให้แสดงออกมาทีละหลัก โดยโปรแกรมทำการรับข้อมูลตัวเลข 4 หลัก แล้วทำการแยกตัวเลขออกจากกันทีละหลัก และแสดงผลออกมาทีละค่า

# รับค่า input มา ไม่ต้องแปลงเป็น int() เพราะ Chapter นี้ยังไม่ได้สอน Loop
number = int(input("Enter integer number : "))

# สร้างตัวแปร n1 มาหารเอาจำนวนเต็ม เพื่อเอาหลักพัน
n1 = number // 1000

# สร้างตัวแปร n2 มาหารเอาจำนวนเต็ม เพื่อเอาหลักร้อย
n2 = (number % 1000) // 100

# สร้างตัวแปร n3 มาหารเอาจำนวนเต็ม เพื่อเอาหลักสิบ
n3 = (number % 100) // 10

# สร้างตัวแปร n4 มาหารเอาจำนวนเต็ม เพื่อเอาหลักหน่วย
n4 = number % 10

# แสดงผลออกมาทางจอภาพโดยดึงจากตำแหน่งของแต่ละตัวอักษรที่กรอกเข้ามา
print(n1)
print(n2)
print(n3)
print(n4)