# 6806021610182 ณัฐวัตร จิตอารี
# 3. ให้นักศึกษาเขียนโปรแกรมช่วยคำนวณหามูลค่าของเงินลงทุนในอนาคต (Future value) จากสูตรที่กำหนดให้ โดยให้มีการรับข้อมูลจำนวนเงินต้น ข้อมูลอัตราดอกเบี้ย และข้อมูลจำนวนปี

# กรอกจำนวนเงินลงทุนเป็น float
amount = float(input("Enter amount : "))

# กรอกจำนวน rate ดอกเบี้ยเป็น float
rate = float(input("Enter rate : "))

# กรอก ปี เป็น integer
year = int(input("Enter year : "))

# สร้างตัวแปรมาคำนวณ โดยเอา amount มาคูณ กับ 1+อัตราดอกเบี้ย หารกับ 100 ละยกกำลังด้วยจำนวนปี
FV = amount*(1+rate/100)**year

print("Future Value : ",FV)