# 6806021610182 ณัฐวัตร จิตอารี
# 4. ให้นักศึกษาเขียนโปรแกรมเพื่อคำนวณหาราคาสินค้าที่ยังไม่รวมภาษีมูลค่าเพิ่ม และค่าภาษีมูลค่าเพิ่มของสินค้า โดยโปรแกรมมีการรับราคาสินค้าที่รวมภาษีมูลค่าเพิ่มแล้ว และแสดงผลราคาสินค้าและภาษีมูลค่าเพิ่ม

# รับค่ายอดเงินสุทธิมา
price_product = float(input("Enter net price product : "))

# สร้างตัวแปร price มากำหนดให้ price_product/1.07 เพื่อหาค่าราคาสินค้าก่อนคิดภาษีมูลค่าเพิ่ม
price = price_product/ 1.07

# สร้างตัวแปร vat มาเพื่อหาค่าภาษีมูลค่าเพิ่ม โดยเอา ราคาสุทธิมา - ราคาสินค้าก่อนคิดภาษีมูลค่าเพิ่ม
vat = price_product - price
print("Price product : ", price)
print("Vat product : ", vat)