# 6806021610182 ณัฐวัตร จิตอารี
# ให้นักศึกษาเขียนโปรแกรมคำนวณหาเกรดของนักศึกษาในวิชาหนึ่ง โดยโปรแกรมจะทำการรับค่าข้อมูลคะแนนนักศึกษาเข้ามามีค่าอยู่ระหว่าง 0-100 เท่านั้น โดยมีการตรวจสอบค่าคะแนนที่รับเข้ามา หากค่าคะแนนที่ใส่มีค่าน้อยกว่า 0 หรือมากกว่า 100 ให้แจ้งข้อความผิดพลาดขึ้นมาแล้วจบการทำงาน แต่ถ้าหากคะแนนอยู่ในช่วง 0-100 แล้ว ให้นำค่าคะแนนที่รับมาไปทำการตรวจสอบว่าจะควรได้เกรดอะไร ตามตารางคะแนนด้านล่าง และให้แสดงผลเกรดของนักศึกษาที่ได้

# รับค่า Input คะแนนเข้ามา
score = float(input("Enter Your Score: "))

# if ถ้าค่าที่รับมาน้อยกว่า 0.0 หรือมากกว่า 100.0 ให้ตัวแปร grade รับค่าข้อความเกิดข้อผิดพลาด
if score < 0.0 or score > 100.0:
    grade = "เกิดข้อผิดพลาด"
# หากคะแนนที่รับค่ามามีค่าน้อยกว่าหรือเท่ากับ 49 ให้ตัวแปรกำหนดค่าเป็นเกรด F
elif score <= 49:
    grade = "F"
# หากคะแนนที่รับค่ามามีค่าน้อยกว่าหรือเท่ากับ 59 ให้ตัวแปรกำหนดค่าเป็นเกรด D
elif score <= 59:
    grade = "D"
# หากคะแนนที่รับค่ามามีค่าน้อยกว่าหรือเท่ากับ 69 ให้ตัวแปรกำหนดค่าเป็นเกรด C
elif score <= 69:
    grade = "C"
# หากคะแนนที่รับค่ามามีค่าน้อยกว่าหรือเท่ากับ 79 ให้ตัวแปรกำหนดค่าเป็นเกรด B
elif score <= 79:
    grade = "B"
# หากคะแนนที่รับค่ามามีค่าน้อยกว่าหรือเท่ากับ 100 ให้ตัวแปรกำหนดค่าเป็นเกรด A
elif score <= 100:
    grade = "A"
# แสดงผลข้อความทั้งคะแนนและเกรดที่ได้
print("Score value", score ,"got grade ", grade)